//
//  SettingUsecase.swift
//  DaDaIkSeon
//
//  Created by 정재명 on 2020/12/07.
//

import Foundation

struct SettingState {
    // 토글 - 상태값으로 관리 가능?
    
}

enum SettingInput {
    // 완료 버튼
    
    // 리프레시 버튼
    // 누르면 정보 다 불러옴. - 라스트 데이트 검사 해서 최신 데이터로 업데이트
    
    // 내정보
    // 이메일 - 터치하면 수정 가능 해야 함. - 수정 후 서버 요청
    
    
    // 백업관리
    // 백업할래? - 토글 - 서버 요청 - on 하면 불러오기
    // 백업 비밀번호 변경 - '화면'필요
            // - 변경 후 요청
    
    
    // 기기관리
    // 멀티디바이스 - 토글
    // 리스트 셀 터치 - 변경 가능해야함 - '화면'필요
    
    // 삭제는 어떻게 하지?
}
